hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_SPI_UART.h
/*******************************************************************************
* File Name: PC_PSoC_UART_SPI_UART.h
* Version 3.0
*
* Description:
*  This file provides constants and parameter values for the SCB Component in
*  SPI and UART modes.
*
* Note:
*
********************************************************************************
* Copyright 2013-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_SPI_UART_PC_PSoC_UART_H)
#define CY_SCB_SPI_UART_PC_PSoC_UART_H

#include "PC_PSoC_UART.h"


/***************************************
*   SPI Initial Parameter Constants
****************************************/

#define PC_PSoC_UART_SPI_MODE                   (0u)
#define PC_PSoC_UART_SPI_SUB_MODE               (0u)
#define PC_PSoC_UART_SPI_CLOCK_MODE             (0u)
#define PC_PSoC_UART_SPI_OVS_FACTOR             (16u)
#define PC_PSoC_UART_SPI_MEDIAN_FILTER_ENABLE   (0u)
#define PC_PSoC_UART_SPI_LATE_MISO_SAMPLE_ENABLE (0u)
#define PC_PSoC_UART_SPI_RX_DATA_BITS_NUM       (8u)
#define PC_PSoC_UART_SPI_TX_DATA_BITS_NUM       (8u)
#define PC_PSoC_UART_SPI_WAKE_ENABLE            (0u)
#define PC_PSoC_UART_SPI_BITS_ORDER             (1u)
#define PC_PSoC_UART_SPI_TRANSFER_SEPARATION    (1u)
#define PC_PSoC_UART_SPI_NUMBER_OF_SS_LINES     (1u)
#define PC_PSoC_UART_SPI_RX_BUFFER_SIZE         (8u)
#define PC_PSoC_UART_SPI_TX_BUFFER_SIZE         (8u)

#define PC_PSoC_UART_SPI_INTERRUPT_MODE         (0u)

#define PC_PSoC_UART_SPI_INTR_RX_MASK           (0u)
#define PC_PSoC_UART_SPI_INTR_TX_MASK           (0u)

#define PC_PSoC_UART_SPI_RX_TRIGGER_LEVEL       (7u)
#define PC_PSoC_UART_SPI_TX_TRIGGER_LEVEL       (0u)

#define PC_PSoC_UART_SPI_BYTE_MODE_ENABLE       (0u)
#define PC_PSoC_UART_SPI_FREE_RUN_SCLK_ENABLE   (0u)
#define PC_PSoC_UART_SPI_SS0_POLARITY           (0u)
#define PC_PSoC_UART_SPI_SS1_POLARITY           (0u)
#define PC_PSoC_UART_SPI_SS2_POLARITY           (0u)
#define PC_PSoC_UART_SPI_SS3_POLARITY           (0u)


/***************************************
*   UART Initial Parameter Constants
****************************************/

#define PC_PSoC_UART_UART_SUB_MODE              (0u)
#define PC_PSoC_UART_UART_DIRECTION             (3u)
#define PC_PSoC_UART_UART_DATA_BITS_NUM         (8u)
#define PC_PSoC_UART_UART_PARITY_TYPE           (2u)
#define PC_PSoC_UART_UART_STOP_BITS_NUM         (2u)
#define PC_PSoC_UART_UART_OVS_FACTOR            (12u)
#define PC_PSoC_UART_UART_IRDA_LOW_POWER        (0u)
#define PC_PSoC_UART_UART_MEDIAN_FILTER_ENABLE  (0u)
#define PC_PSoC_UART_UART_RETRY_ON_NACK         (0u)
#define PC_PSoC_UART_UART_IRDA_POLARITY         (0u)
#define PC_PSoC_UART_UART_DROP_ON_FRAME_ERR     (0u)
#define PC_PSoC_UART_UART_DROP_ON_PARITY_ERR    (0u)
#define PC_PSoC_UART_UART_WAKE_ENABLE           (0u)
#define PC_PSoC_UART_UART_RX_BUFFER_SIZE        (8u)
#define PC_PSoC_UART_UART_TX_BUFFER_SIZE        (8u)
#define PC_PSoC_UART_UART_MP_MODE_ENABLE        (0u)
#define PC_PSoC_UART_UART_MP_ACCEPT_ADDRESS     (0u)
#define PC_PSoC_UART_UART_MP_RX_ADDRESS         (2u)
#define PC_PSoC_UART_UART_MP_RX_ADDRESS_MASK    (255u)

#define PC_PSoC_UART_UART_INTERRUPT_MODE        (0u)

#define PC_PSoC_UART_UART_INTR_RX_MASK          (0u)
#define PC_PSoC_UART_UART_INTR_TX_MASK          (0u)

#define PC_PSoC_UART_UART_RX_TRIGGER_LEVEL      (7u)
#define PC_PSoC_UART_UART_TX_TRIGGER_LEVEL      (0u)

#define PC_PSoC_UART_UART_BYTE_MODE_ENABLE      (0u)
#define PC_PSoC_UART_UART_CTS_ENABLE            (0u)
#define PC_PSoC_UART_UART_CTS_POLARITY          (0u)
#define PC_PSoC_UART_UART_RTS_ENABLE            (0u)
#define PC_PSoC_UART_UART_RTS_POLARITY          (0u)
#define PC_PSoC_UART_UART_RTS_FIFO_LEVEL        (4u)

/* SPI mode enum */
#define PC_PSoC_UART_SPI_SLAVE  (0u)
#define PC_PSoC_UART_SPI_MASTER (1u)

/* UART direction enum */
#define PC_PSoC_UART_UART_RX    (1u)
#define PC_PSoC_UART_UART_TX    (2u)
#define PC_PSoC_UART_UART_TX_RX (3u)


/***************************************
*   Conditional Compilation Parameters
****************************************/

#if(PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG)

    /* Mode */
    #define PC_PSoC_UART_SPI_SLAVE_CONST        (1u)
    #define PC_PSoC_UART_SPI_MASTER_CONST       (1u)

    /* Direction */
    #define PC_PSoC_UART_RX_DIRECTION           (1u)
    #define PC_PSoC_UART_TX_DIRECTION           (1u)
    #define PC_PSoC_UART_UART_RX_DIRECTION      (1u)
    #define PC_PSoC_UART_UART_TX_DIRECTION      (1u)

    /* Only external RX and TX buffer for Uncofigured mode */
    #define PC_PSoC_UART_INTERNAL_RX_SW_BUFFER   (0u)
    #define PC_PSoC_UART_INTERNAL_TX_SW_BUFFER   (0u)

    /* Get RX and TX buffer size */
    #define PC_PSoC_UART_INTERNAL_RX_BUFFER_SIZE    (PC_PSoC_UART_rxBufferSize + 1u)
    #define PC_PSoC_UART_RX_BUFFER_SIZE             (PC_PSoC_UART_rxBufferSize)
    #define PC_PSoC_UART_TX_BUFFER_SIZE             (PC_PSoC_UART_txBufferSize)

    /* Return true if buffer is provided */
    #define PC_PSoC_UART_CHECK_RX_SW_BUFFER (NULL != PC_PSoC_UART_rxBuffer)
    #define PC_PSoC_UART_CHECK_TX_SW_BUFFER (NULL != PC_PSoC_UART_txBuffer)

    /* Always provide global variables to support RX and TX buffers */
    #define PC_PSoC_UART_INTERNAL_RX_SW_BUFFER_CONST    (1u)
    #define PC_PSoC_UART_INTERNAL_TX_SW_BUFFER_CONST    (1u)

    /* Get wakeup enable option */
    #define PC_PSoC_UART_SPI_WAKE_ENABLE_CONST  (1u)
    #define PC_PSoC_UART_CHECK_SPI_WAKE_ENABLE  (0u != PC_PSoC_UART_scbEnableWake)
    #define PC_PSoC_UART_UART_WAKE_ENABLE_CONST (1u)

    /* SPI/UART: TX or RX FIFO size */
    #if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
        #define PC_PSoC_UART_SPI_UART_FIFO_SIZE             (PC_PSoC_UART_FIFO_SIZE)
        #define PC_PSoC_UART_CHECK_UART_RTS_CONTROL_FLOW    (0u)
    #else
        #define PC_PSoC_UART_SPI_UART_FIFO_SIZE (PC_PSoC_UART_GET_FIFO_SIZE(PC_PSoC_UART_CTRL_REG & \
                                                                                    PC_PSoC_UART_CTRL_BYTE_MODE))

        #define PC_PSoC_UART_CHECK_UART_RTS_CONTROL_FLOW \
                    ((PC_PSoC_UART_SCB_MODE_UART_RUNTM_CFG) && \
                     (0u != PC_PSoC_UART_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(PC_PSoC_UART_UART_FLOW_CTRL_REG)))
    #endif /* (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

#else

