hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_SPI_UART.h
    /* Internal RX and TX buffer: for SPI or UART */
    #if (PC_PSoC_UART_SCB_MODE_SPI_CONST_CFG)

        /* SPI Direction */
        #define PC_PSoC_UART_SPI_RX_DIRECTION (1u)
        #define PC_PSoC_UART_SPI_TX_DIRECTION (1u)

        /* Get FIFO size */
        #if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
            #define PC_PSoC_UART_SPI_UART_FIFO_SIZE    (PC_PSoC_UART_FIFO_SIZE)
        #else
            #define PC_PSoC_UART_SPI_UART_FIFO_SIZE \
                                           PC_PSoC_UART_GET_FIFO_SIZE(PC_PSoC_UART_SPI_BYTE_MODE_ENABLE)

        #endif /* (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

        /* SPI internal RX and TX buffers */
        #define PC_PSoC_UART_INTERNAL_SPI_RX_SW_BUFFER  (PC_PSoC_UART_SPI_RX_BUFFER_SIZE > \
                                                                PC_PSoC_UART_SPI_UART_FIFO_SIZE)
        #define PC_PSoC_UART_INTERNAL_SPI_TX_SW_BUFFER  (PC_PSoC_UART_SPI_TX_BUFFER_SIZE > \
                                                                PC_PSoC_UART_SPI_UART_FIFO_SIZE)

        /* Internal SPI RX and TX buffer */
        #define PC_PSoC_UART_INTERNAL_RX_SW_BUFFER  (PC_PSoC_UART_INTERNAL_SPI_RX_SW_BUFFER)
        #define PC_PSoC_UART_INTERNAL_TX_SW_BUFFER  (PC_PSoC_UART_INTERNAL_SPI_TX_SW_BUFFER)

        /* Internal SPI RX and TX buffer size */
        #define PC_PSoC_UART_INTERNAL_RX_BUFFER_SIZE    (PC_PSoC_UART_SPI_RX_BUFFER_SIZE + 1u)
        #define PC_PSoC_UART_RX_BUFFER_SIZE             (PC_PSoC_UART_SPI_RX_BUFFER_SIZE)
        #define PC_PSoC_UART_TX_BUFFER_SIZE             (PC_PSoC_UART_SPI_TX_BUFFER_SIZE)

        /* Get wakeup enable option */
        #define PC_PSoC_UART_SPI_WAKE_ENABLE_CONST  (0u != PC_PSoC_UART_SPI_WAKE_ENABLE)
        #define PC_PSoC_UART_UART_WAKE_ENABLE_CONST (0u)

    #else

        /* UART Direction */
        #define PC_PSoC_UART_UART_RX_DIRECTION (0u != (PC_PSoC_UART_UART_DIRECTION & PC_PSoC_UART_UART_RX))
        #define PC_PSoC_UART_UART_TX_DIRECTION (0u != (PC_PSoC_UART_UART_DIRECTION & PC_PSoC_UART_UART_TX))

        /* Get FIFO size */
        #if (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
            #define PC_PSoC_UART_SPI_UART_FIFO_SIZE    (PC_PSoC_UART_FIFO_SIZE)
        #else
            #define PC_PSoC_UART_SPI_UART_FIFO_SIZE \
                                           PC_PSoC_UART_GET_FIFO_SIZE(PC_PSoC_UART_UART_BYTE_MODE_ENABLE)
        #endif /* (PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */

        /* UART internal RX and TX buffers */
        #define PC_PSoC_UART_INTERNAL_UART_RX_SW_BUFFER  (PC_PSoC_UART_UART_RX_BUFFER_SIZE > \
                                                                PC_PSoC_UART_SPI_UART_FIFO_SIZE)
        #define PC_PSoC_UART_INTERNAL_UART_TX_SW_BUFFER  (PC_PSoC_UART_UART_TX_BUFFER_SIZE > \
                                                                    PC_PSoC_UART_SPI_UART_FIFO_SIZE)

        /* Internal UART RX and TX buffer */
        #define PC_PSoC_UART_INTERNAL_RX_SW_BUFFER  (PC_PSoC_UART_INTERNAL_UART_RX_SW_BUFFER)
        #define PC_PSoC_UART_INTERNAL_TX_SW_BUFFER  (PC_PSoC_UART_INTERNAL_UART_TX_SW_BUFFER)

        /* Internal UART RX and TX buffer size */
        #define PC_PSoC_UART_INTERNAL_RX_BUFFER_SIZE    (PC_PSoC_UART_UART_RX_BUFFER_SIZE + 1u)
        #define PC_PSoC_UART_RX_BUFFER_SIZE             (PC_PSoC_UART_UART_RX_BUFFER_SIZE)
        #define PC_PSoC_UART_TX_BUFFER_SIZE             (PC_PSoC_UART_UART_TX_BUFFER_SIZE)

        /* Get wakeup enable option */
        #define PC_PSoC_UART_SPI_WAKE_ENABLE_CONST  (0u)
        #define PC_PSoC_UART_UART_WAKE_ENABLE_CONST (0u != PC_PSoC_UART_UART_WAKE_ENABLE)

    #endif /* (PC_PSoC_UART_SCB_MODE_SPI_CONST_CFG) */

    /* Mode */
    #define PC_PSoC_UART_SPI_SLAVE_CONST    (PC_PSoC_UART_SPI_MODE == PC_PSoC_UART_SPI_SLAVE)
    #define PC_PSoC_UART_SPI_MASTER_CONST   (PC_PSoC_UART_SPI_MODE == PC_PSoC_UART_SPI_MASTER)

    /* Direction */
    #define PC_PSoC_UART_RX_DIRECTION ((PC_PSoC_UART_SCB_MODE_SPI_CONST_CFG) ? \
                                            (PC_PSoC_UART_SPI_RX_DIRECTION) : (PC_PSoC_UART_UART_RX_DIRECTION))

    #define PC_PSoC_UART_TX_DIRECTION ((PC_PSoC_UART_SCB_MODE_SPI_CONST_CFG) ? \
                                            (PC_PSoC_UART_SPI_TX_DIRECTION) : (PC_PSoC_UART_UART_TX_DIRECTION))

    /* Internal RX and TX buffer: for SPI or UART. Used in conditional compilation check */
    #define PC_PSoC_UART_CHECK_RX_SW_BUFFER (PC_PSoC_UART_INTERNAL_RX_SW_BUFFER)
    #define PC_PSoC_UART_CHECK_TX_SW_BUFFER (PC_PSoC_UART_INTERNAL_TX_SW_BUFFER)

    /* Provide global variables to support RX and TX buffers */
    #define PC_PSoC_UART_INTERNAL_RX_SW_BUFFER_CONST    (PC_PSoC_UART_INTERNAL_RX_SW_BUFFER)
    #define PC_PSoC_UART_INTERNAL_TX_SW_BUFFER_CONST    (PC_PSoC_UART_INTERNAL_TX_SW_BUFFER)

    /* SPI wakeup */
    #define PC_PSoC_UART_CHECK_SPI_WAKE_ENABLE  (PC_PSoC_UART_SPI_WAKE_ENABLE_CONST)

    /* UART flow control: not applicable for CY_SCBIP_V0 || CY_SCBIP_V1 */
    #define PC_PSoC_UART_CHECK_UART_RTS_CONTROL_FLOW    (PC_PSoC_UART_SCB_MODE_UART_CONST_CFG && \
                                                             PC_PSoC_UART_UART_RTS_ENABLE)

#endif /* End (PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG) */


/***************************************
*       Type Definitions
***************************************/

/* PC_PSoC_UART_SPI_INIT_STRUCT */
typedef struct
{
    uint32 mode;
    uint32 submode;
    uint32 sclkMode;
    uint32 oversample;
    uint32 enableMedianFilter;
    uint32 enableLateSampling;
    uint32 enableWake;
    uint32 rxDataBits;
    uint32 txDataBits;
    uint32 bitOrder;
    uint32 transferSeperation;
    uint32 rxBufferSize;
    uint8* rxBuffer;
    uint32 txBufferSize;
    uint8* txBuffer;
    uint32 enableInterrupt;
    uint32 rxInterruptMask;
    uint32 rxTriggerLevel;
    uint32 txInterruptMask;
    uint32 txTriggerLevel;
    uint8 enableByteMode;
    uint8 enableFreeRunSclk;
    uint8 polaritySs;
} PC_PSoC_UART_SPI_INIT_STRUCT;

/* PC_PSoC_UART_UART_INIT_STRUCT */
typedef struct
{
    uint32 mode;
    uint32 direction;
    uint32 dataBits;
    uint32 parity;
    uint32 stopBits;
    uint32 oversample;
    uint32 enableIrdaLowPower;
    uint32 enableMedianFilter;
    uint32 enableRetryNack;
    uint32 enableInvertedRx;
    uint32 dropOnParityErr;
    uint32 dropOnFrameErr;
    uint32 enableWake;
    uint32 rxBufferSize;
    uint8* rxBuffer;
    uint32 txBufferSize;
    uint8* txBuffer;
    uint32 enableMultiproc;
    uint32 multiprocAcceptAddr;
    uint32 multiprocAddr;
    uint32 multiprocAddrMask;
    uint32 enableInterrupt;
    uint32 rxInterruptMask;
    uint32 rxTriggerLevel;
    uint32 txInterruptMask;
    uint32 txTriggerLevel;
    uint8 enableByteMode;
    uint8 enableCts;
    uint8 ctsPolarity;
    uint8 rtsRxFifoLevel;
    uint8 rtsPolarity;
} PC_PSoC_UART_UART_INIT_STRUCT;


