hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_SPI_UART.h
/***************************************
*        Function Prototypes
***************************************/

/* SPI specific functions */
#if(PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG)
    void PC_PSoC_UART_SpiInit(const PC_PSoC_UART_SPI_INIT_STRUCT *config);
#endif /* (PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG) */

#if(PC_PSoC_UART_SCB_MODE_SPI_INC)
    #define PC_PSoC_UART_SpiIsBusBusy() ((uint32) (0u != (PC_PSoC_UART_SPI_STATUS_REG & \
                                                              PC_PSoC_UART_SPI_STATUS_BUS_BUSY)))

    #if (PC_PSoC_UART_SPI_MASTER_CONST)
        void PC_PSoC_UART_SpiSetActiveSlaveSelect(uint32 slaveSelect);
    #endif /*(PC_PSoC_UART_SPI_MASTER_CONST) */

    #if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
        void PC_PSoC_UART_SpiSetSlaveSelectPolarity(uint32 slaveSelect, uint32 polarity);
    #endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */
#endif /* (PC_PSoC_UART_SCB_MODE_SPI_INC) */

/* UART specific functions */
#if(PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG)
    void PC_PSoC_UART_UartInit(const PC_PSoC_UART_UART_INIT_STRUCT *config);
#endif /* (PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG) */

#if(PC_PSoC_UART_SCB_MODE_UART_INC)
    void PC_PSoC_UART_UartSetRxAddress(uint32 address);
    void PC_PSoC_UART_UartSetRxAddressMask(uint32 addressMask);

    /* UART RX direction APIs */
    #if(PC_PSoC_UART_UART_RX_DIRECTION)
        uint32 PC_PSoC_UART_UartGetChar(void);
        uint32 PC_PSoC_UART_UartGetByte(void);

        #if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
            /* UART APIs for Flow Control */
            void PC_PSoC_UART_UartSetRtsPolarity(uint32 polarity);
            void PC_PSoC_UART_UartSetRtsFifoLevel(uint32 level);
        #endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */
    #endif /* (PC_PSoC_UART_UART_RX_DIRECTION) */

    /* UART TX direction APIs */
    #if(PC_PSoC_UART_UART_TX_DIRECTION)
        #define PC_PSoC_UART_UartPutChar(ch)    PC_PSoC_UART_SpiUartWriteTxData((uint32)(ch))
        void PC_PSoC_UART_UartPutString(const char8 string[]);
        void PC_PSoC_UART_UartPutCRLF(uint32 txDataByte);

        #if !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1)
            /* UART APIs for Flow Control */
            void PC_PSoC_UART_UartEnableCts(void);
            void PC_PSoC_UART_UartDisableCts(void);
            void PC_PSoC_UART_UartSetCtsPolarity(uint32 polarity);
        #endif /* !(PC_PSoC_UART_CY_SCBIP_V0 || PC_PSoC_UART_CY_SCBIP_V1) */
    #endif /* (PC_PSoC_UART_UART_TX_DIRECTION) */
#endif /* (PC_PSoC_UART_SCB_MODE_UART_INC) */

/* Common APIs RX direction */
#if(PC_PSoC_UART_RX_DIRECTION)
    uint32 PC_PSoC_UART_SpiUartReadRxData(void);
    uint32 PC_PSoC_UART_SpiUartGetRxBufferSize(void);
    void   PC_PSoC_UART_SpiUartClearRxBuffer(void);
#endif /* (PC_PSoC_UART_RX_DIRECTION) */

/* Common APIs TX direction */
#if(PC_PSoC_UART_TX_DIRECTION)
    void   PC_PSoC_UART_SpiUartWriteTxData(uint32 txData);
    void   PC_PSoC_UART_SpiUartPutArray(const uint8 wrBuf[], uint32 count);
    uint32 PC_PSoC_UART_SpiUartGetTxBufferSize(void);
    void   PC_PSoC_UART_SpiUartClearTxBuffer(void);
#endif /* (PC_PSoC_UART_TX_DIRECTION) */

CY_ISR_PROTO(PC_PSoC_UART_SPI_UART_ISR);

#if(PC_PSoC_UART_UART_RX_WAKEUP_IRQ)
    CY_ISR_PROTO(PC_PSoC_UART_UART_WAKEUP_ISR);
#endif /* (PC_PSoC_UART_UART_RX_WAKEUP_IRQ) */


/***************************************
*     Buffer Access Macro Definitions
***************************************/

#if(PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG)
    /* RX direction */
    void   PC_PSoC_UART_PutWordInRxBuffer  (uint32 idx, uint32 rxDataByte);
    uint32 PC_PSoC_UART_GetWordFromRxBuffer(uint32 idx);

    /* TX direction */
    void   PC_PSoC_UART_PutWordInTxBuffer  (uint32 idx, uint32 txDataByte);
    uint32 PC_PSoC_UART_GetWordFromTxBuffer(uint32 idx);

#else
    /* RX direction */
    #if(PC_PSoC_UART_INTERNAL_RX_SW_BUFFER_CONST)
        #define PC_PSoC_UART_PutWordInRxBuffer(idx, rxDataByte) \
                do{                                                 \
                    PC_PSoC_UART_rxBufferInternal[(idx)] = ((uint8) (rxDataByte)); \
                }while(0)

        #define PC_PSoC_UART_GetWordFromRxBuffer(idx) PC_PSoC_UART_rxBufferInternal[(idx)]

    #endif /* (PC_PSoC_UART_INTERNAL_RX_SW_BUFFER_CONST) */

    /* TX direction */
    #if(PC_PSoC_UART_INTERNAL_TX_SW_BUFFER_CONST)
        #define PC_PSoC_UART_PutWordInTxBuffer(idx, txDataByte) \
                    do{                                             \
                        PC_PSoC_UART_txBufferInternal[(idx)] = ((uint8) (txDataByte)); \
                    }while(0)

        #define PC_PSoC_UART_GetWordFromTxBuffer(idx) PC_PSoC_UART_txBufferInternal[(idx)]

    #endif /* (PC_PSoC_UART_INTERNAL_TX_SW_BUFFER_CONST) */

#endif /* (PC_PSoC_UART_TX_SW_BUFFER_ENABLE) */


/***************************************
*         SPI API Constants
***************************************/

/* SPI sub mode enum */
#define PC_PSoC_UART_SPI_MODE_MOTOROLA      (0x00u)
#define PC_PSoC_UART_SPI_MODE_TI_COINCIDES  (0x01u)
#define PC_PSoC_UART_SPI_MODE_TI_PRECEDES   (0x11u)
#define PC_PSoC_UART_SPI_MODE_NATIONAL      (0x02u)
#define PC_PSoC_UART_SPI_MODE_MASK          (0x03u)
#define PC_PSoC_UART_SPI_MODE_TI_PRECEDES_MASK  (0x10u)
#define PC_PSoC_UART_SPI_MODE_NS_MICROWIRE  (PC_PSoC_UART_SPI_MODE_NATIONAL)

/* SPI phase and polarity mode enum */
#define PC_PSoC_UART_SPI_SCLK_CPHA0_CPOL0   (0x00u)
#define PC_PSoC_UART_SPI_SCLK_CPHA0_CPOL1   (0x02u)
#define PC_PSoC_UART_SPI_SCLK_CPHA1_CPOL0   (0x01u)
#define PC_PSoC_UART_SPI_SCLK_CPHA1_CPOL1   (0x03u)

/* SPI bits order enum */
#define PC_PSoC_UART_BITS_ORDER_LSB_FIRST   (0u)
#define PC_PSoC_UART_BITS_ORDER_MSB_FIRST   (1u)

/* SPI transfer separation enum */
#define PC_PSoC_UART_SPI_TRANSFER_SEPARATED     (0u)
#define PC_PSoC_UART_SPI_TRANSFER_CONTINUOUS    (1u)

/* SPI slave select constants */
#define PC_PSoC_UART_SPI_SLAVE_SELECT0    (PC_PSoC_UART_SCB__SS0_POSISTION)
#define PC_PSoC_UART_SPI_SLAVE_SELECT1    (PC_PSoC_UART_SCB__SS1_POSISTION)
#define PC_PSoC_UART_SPI_SLAVE_SELECT2    (PC_PSoC_UART_SCB__SS2_POSISTION)
#define PC_PSoC_UART_SPI_SLAVE_SELECT3    (PC_PSoC_UART_SCB__SS3_POSISTION)

