hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_SPI_UART.h
/* SPI slave select polarity settings */
#define PC_PSoC_UART_SPI_SS_ACTIVE_LOW  (0u)
#define PC_PSoC_UART_SPI_SS_ACTIVE_HIGH (1u)


/***************************************
*         UART API Constants
***************************************/

/* UART sub-modes enum */
#define PC_PSoC_UART_UART_MODE_STD          (0u)
#define PC_PSoC_UART_UART_MODE_SMARTCARD    (1u)
#define PC_PSoC_UART_UART_MODE_IRDA         (2u)

/* UART direction enum */
#define PC_PSoC_UART_UART_RX    (1u)
#define PC_PSoC_UART_UART_TX    (2u)
#define PC_PSoC_UART_UART_TX_RX (3u)

/* UART parity enum */
#define PC_PSoC_UART_UART_PARITY_EVEN   (0u)
#define PC_PSoC_UART_UART_PARITY_ODD    (1u)
#define PC_PSoC_UART_UART_PARITY_NONE   (2u)

/* UART stop bits enum */
#define PC_PSoC_UART_UART_STOP_BITS_1   (2u)
#define PC_PSoC_UART_UART_STOP_BITS_1_5 (3u)
#define PC_PSoC_UART_UART_STOP_BITS_2   (4u)

/* UART IrDA low power OVS enum */
#define PC_PSoC_UART_UART_IRDA_LP_OVS16     (16u)
#define PC_PSoC_UART_UART_IRDA_LP_OVS32     (32u)
#define PC_PSoC_UART_UART_IRDA_LP_OVS48     (48u)
#define PC_PSoC_UART_UART_IRDA_LP_OVS96     (96u)
#define PC_PSoC_UART_UART_IRDA_LP_OVS192    (192u)
#define PC_PSoC_UART_UART_IRDA_LP_OVS768    (768u)
#define PC_PSoC_UART_UART_IRDA_LP_OVS1536   (1536u)

/* Uart MP: mark (address) and space (data) bit definitions */
#define PC_PSoC_UART_UART_MP_MARK       (0x100u)
#define PC_PSoC_UART_UART_MP_SPACE      (0x000u)

/* UART CTS/RTS polarity settings */
#define PC_PSoC_UART_UART_CTS_ACTIVE_LOW    (0u)
#define PC_PSoC_UART_UART_CTS_ACTIVE_HIGH   (1u)
#define PC_PSoC_UART_UART_RTS_ACTIVE_LOW    (0u)
#define PC_PSoC_UART_UART_RTS_ACTIVE_HIGH   (1u)

/* Sources of RX errors */
#define PC_PSoC_UART_INTR_RX_ERR        (PC_PSoC_UART_INTR_RX_OVERFLOW    | \
                                             PC_PSoC_UART_INTR_RX_UNDERFLOW   | \
                                             PC_PSoC_UART_INTR_RX_FRAME_ERROR | \
                                             PC_PSoC_UART_INTR_RX_PARITY_ERROR)

/* Shifted INTR_RX_ERR defines ONLY for PC_PSoC_UART_UartGetByte() */
#define PC_PSoC_UART_UART_RX_OVERFLOW       (PC_PSoC_UART_INTR_RX_OVERFLOW << 8u)
#define PC_PSoC_UART_UART_RX_UNDERFLOW      (PC_PSoC_UART_INTR_RX_UNDERFLOW << 8u)
#define PC_PSoC_UART_UART_RX_FRAME_ERROR    (PC_PSoC_UART_INTR_RX_FRAME_ERROR << 8u)
#define PC_PSoC_UART_UART_RX_PARITY_ERROR   (PC_PSoC_UART_INTR_RX_PARITY_ERROR << 8u)
#define PC_PSoC_UART_UART_RX_ERROR_MASK     (PC_PSoC_UART_UART_RX_OVERFLOW    | \
                                                 PC_PSoC_UART_UART_RX_UNDERFLOW   | \
                                                 PC_PSoC_UART_UART_RX_FRAME_ERROR | \
                                                 PC_PSoC_UART_UART_RX_PARITY_ERROR)


/***************************************
*     Vars with External Linkage
***************************************/

#if(PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG)
    extern const PC_PSoC_UART_SPI_INIT_STRUCT  PC_PSoC_UART_configSpi;
    extern const PC_PSoC_UART_UART_INIT_STRUCT PC_PSoC_UART_configUart;
#endif /* (PC_PSoC_UART_SCB_MODE_UNCONFIG_CONST_CFG) */


/***************************************
*    Specific SPI Macro Definitions
***************************************/

#define PC_PSoC_UART_GET_SPI_INTR_SLAVE_MASK(sourceMask)  ((sourceMask) & PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR)
#define PC_PSoC_UART_GET_SPI_INTR_MASTER_MASK(sourceMask) ((sourceMask) & PC_PSoC_UART_INTR_MASTER_SPI_DONE)
#define PC_PSoC_UART_GET_SPI_INTR_RX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR)

#define PC_PSoC_UART_GET_SPI_INTR_TX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~PC_PSoC_UART_INTR_MASTER_SPI_DONE)


/***************************************
*    Specific UART Macro Definitions
***************************************/

#define PC_PSoC_UART_UART_GET_CTRL_OVS_IRDA_LP(oversample) \
        ((PC_PSoC_UART_UART_IRDA_LP_OVS16   == (oversample)) ? PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS16 : \
         ((PC_PSoC_UART_UART_IRDA_LP_OVS32   == (oversample)) ? PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS32 : \
          ((PC_PSoC_UART_UART_IRDA_LP_OVS48   == (oversample)) ? PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS48 : \
           ((PC_PSoC_UART_UART_IRDA_LP_OVS96   == (oversample)) ? PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS96 : \
            ((PC_PSoC_UART_UART_IRDA_LP_OVS192  == (oversample)) ? PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS192 : \
             ((PC_PSoC_UART_UART_IRDA_LP_OVS768  == (oversample)) ? PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS768 : \
              ((PC_PSoC_UART_UART_IRDA_LP_OVS1536 == (oversample)) ? PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS1536 : \
                                                                          PC_PSoC_UART_CTRL_OVS_IRDA_LP_OVS16)))))))

#define PC_PSoC_UART_GET_UART_RX_CTRL_ENABLED(direction) ((0u != (PC_PSoC_UART_UART_RX & (direction))) ? \
                                                                     (PC_PSoC_UART_RX_CTRL_ENABLED) : (0u))

#define PC_PSoC_UART_GET_UART_TX_CTRL_ENABLED(direction) ((0u != (PC_PSoC_UART_UART_TX & (direction))) ? \
                                                                     (PC_PSoC_UART_TX_CTRL_ENABLED) : (0u))


/***************************************
*        SPI Register Settings
***************************************/

#define PC_PSoC_UART_CTRL_SPI      (PC_PSoC_UART_CTRL_MODE_SPI)
#define PC_PSoC_UART_SPI_RX_CTRL   (PC_PSoC_UART_RX_CTRL_ENABLED)
#define PC_PSoC_UART_SPI_TX_CTRL   (PC_PSoC_UART_TX_CTRL_ENABLED)


/***************************************
*       SPI Init Register Settings
***************************************/

#define PC_PSoC_UART_SPI_SS_POLARITY \
             (((uint32) PC_PSoC_UART_SPI_SS0_POLARITY << PC_PSoC_UART_SPI_SLAVE_SELECT0) | \
              ((uint32) PC_PSoC_UART_SPI_SS1_POLARITY << PC_PSoC_UART_SPI_SLAVE_SELECT1) | \
              ((uint32) PC_PSoC_UART_SPI_SS2_POLARITY << PC_PSoC_UART_SPI_SLAVE_SELECT2) | \
              ((uint32) PC_PSoC_UART_SPI_SS3_POLARITY << PC_PSoC_UART_SPI_SLAVE_SELECT3))

#if(PC_PSoC_UART_SCB_MODE_SPI_CONST_CFG)

