hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_SPI_UART.h
    /* SPI Configuration */
    #define PC_PSoC_UART_SPI_DEFAULT_CTRL \
                    (PC_PSoC_UART_GET_CTRL_OVS(PC_PSoC_UART_SPI_OVS_FACTOR) | \
                     PC_PSoC_UART_GET_CTRL_BYTE_MODE (PC_PSoC_UART_SPI_BYTE_MODE_ENABLE) | \
                     PC_PSoC_UART_GET_CTRL_EC_AM_MODE(PC_PSoC_UART_SPI_WAKE_ENABLE)      | \
                     PC_PSoC_UART_CTRL_SPI)

    #define PC_PSoC_UART_SPI_DEFAULT_SPI_CTRL \
                    (PC_PSoC_UART_GET_SPI_CTRL_CONTINUOUS    (PC_PSoC_UART_SPI_TRANSFER_SEPARATION)       | \
                     PC_PSoC_UART_GET_SPI_CTRL_SELECT_PRECEDE(PC_PSoC_UART_SPI_SUB_MODE &                   \
                                                                  PC_PSoC_UART_SPI_MODE_TI_PRECEDES_MASK)     | \
                     PC_PSoC_UART_GET_SPI_CTRL_SCLK_MODE     (PC_PSoC_UART_SPI_CLOCK_MODE)                | \
                     PC_PSoC_UART_GET_SPI_CTRL_LATE_MISO_SAMPLE(PC_PSoC_UART_SPI_LATE_MISO_SAMPLE_ENABLE) | \
                     PC_PSoC_UART_GET_SPI_CTRL_SCLK_CONTINUOUS(PC_PSoC_UART_SPI_FREE_RUN_SCLK_ENABLE)     | \
                     PC_PSoC_UART_GET_SPI_CTRL_SSEL_POLARITY (PC_PSoC_UART_SPI_SS_POLARITY)               | \
                     PC_PSoC_UART_GET_SPI_CTRL_SUB_MODE      (PC_PSoC_UART_SPI_SUB_MODE)                  | \
                     PC_PSoC_UART_GET_SPI_CTRL_MASTER_MODE   (PC_PSoC_UART_SPI_MODE))

    /* RX direction */
    #define PC_PSoC_UART_SPI_DEFAULT_RX_CTRL \
                    (PC_PSoC_UART_GET_RX_CTRL_DATA_WIDTH(PC_PSoC_UART_SPI_RX_DATA_BITS_NUM)     | \
                     PC_PSoC_UART_GET_RX_CTRL_BIT_ORDER (PC_PSoC_UART_SPI_BITS_ORDER)           | \
                     PC_PSoC_UART_GET_RX_CTRL_MEDIAN    (PC_PSoC_UART_SPI_MEDIAN_FILTER_ENABLE) | \
                     PC_PSoC_UART_SPI_RX_CTRL)

    #define PC_PSoC_UART_SPI_DEFAULT_RX_FIFO_CTRL \
                    PC_PSoC_UART_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(PC_PSoC_UART_SPI_RX_TRIGGER_LEVEL)

    /* TX direction */
    #define PC_PSoC_UART_SPI_DEFAULT_TX_CTRL \
                    (PC_PSoC_UART_GET_TX_CTRL_DATA_WIDTH(PC_PSoC_UART_SPI_TX_DATA_BITS_NUM) | \
                     PC_PSoC_UART_GET_TX_CTRL_BIT_ORDER (PC_PSoC_UART_SPI_BITS_ORDER)       | \
                     PC_PSoC_UART_SPI_TX_CTRL)

    #define PC_PSoC_UART_SPI_DEFAULT_TX_FIFO_CTRL \
                    PC_PSoC_UART_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(PC_PSoC_UART_SPI_TX_TRIGGER_LEVEL)

    /* Interrupt sources */
    #define PC_PSoC_UART_SPI_DEFAULT_INTR_SPI_EC_MASK   (PC_PSoC_UART_NO_INTR_SOURCES)

    #define PC_PSoC_UART_SPI_DEFAULT_INTR_I2C_EC_MASK   (PC_PSoC_UART_NO_INTR_SOURCES)
    #define PC_PSoC_UART_SPI_DEFAULT_INTR_SLAVE_MASK \
                    (PC_PSoC_UART_SPI_INTR_RX_MASK & PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR)

    #define PC_PSoC_UART_SPI_DEFAULT_INTR_MASTER_MASK \
                    (PC_PSoC_UART_SPI_INTR_TX_MASK & PC_PSoC_UART_INTR_MASTER_SPI_DONE)

    #define PC_PSoC_UART_SPI_DEFAULT_INTR_RX_MASK \
                    (PC_PSoC_UART_SPI_INTR_RX_MASK & (uint32) ~PC_PSoC_UART_INTR_SLAVE_SPI_BUS_ERROR)

    #define PC_PSoC_UART_SPI_DEFAULT_INTR_TX_MASK \
                    (PC_PSoC_UART_SPI_INTR_TX_MASK & (uint32) ~PC_PSoC_UART_INTR_MASTER_SPI_DONE)

#endif /* (PC_PSoC_UART_SCB_MODE_SPI_CONST_CFG) */


/***************************************
*        UART Register Settings
***************************************/

#define PC_PSoC_UART_CTRL_UART      (PC_PSoC_UART_CTRL_MODE_UART)
#define PC_PSoC_UART_UART_RX_CTRL   (PC_PSoC_UART_RX_CTRL_LSB_FIRST) /* LSB for UART goes first */
#define PC_PSoC_UART_UART_TX_CTRL   (PC_PSoC_UART_TX_CTRL_LSB_FIRST) /* LSB for UART goes first */


/***************************************
*      UART Init Register Settings
***************************************/

#if(PC_PSoC_UART_SCB_MODE_UART_CONST_CFG)

    /* UART configuration */
    #if(PC_PSoC_UART_UART_MODE_IRDA == PC_PSoC_UART_UART_SUB_MODE)

        #define PC_PSoC_UART_DEFAULT_CTRL_OVS   ((0u != PC_PSoC_UART_UART_IRDA_LOW_POWER) ?              \
                                (PC_PSoC_UART_UART_GET_CTRL_OVS_IRDA_LP(PC_PSoC_UART_UART_OVS_FACTOR)) : \
                                (PC_PSoC_UART_CTRL_OVS_IRDA_OVS16))

    #else

        #define PC_PSoC_UART_DEFAULT_CTRL_OVS   PC_PSoC_UART_GET_CTRL_OVS(PC_PSoC_UART_UART_OVS_FACTOR)

    #endif /* (PC_PSoC_UART_UART_MODE_IRDA == PC_PSoC_UART_UART_SUB_MODE) */

    #define PC_PSoC_UART_UART_DEFAULT_CTRL \
                                (PC_PSoC_UART_GET_CTRL_BYTE_MODE  (PC_PSoC_UART_UART_BYTE_MODE_ENABLE)  | \
                                 PC_PSoC_UART_GET_CTRL_ADDR_ACCEPT(PC_PSoC_UART_UART_MP_ACCEPT_ADDRESS) | \
                                 PC_PSoC_UART_DEFAULT_CTRL_OVS                                              | \
                                 PC_PSoC_UART_CTRL_UART)

    #define PC_PSoC_UART_UART_DEFAULT_UART_CTRL \
                                    (PC_PSoC_UART_GET_UART_CTRL_MODE(PC_PSoC_UART_UART_SUB_MODE))

    /* RX direction */
    #define PC_PSoC_UART_UART_DEFAULT_RX_CTRL_PARITY \
                                ((PC_PSoC_UART_UART_PARITY_NONE != PC_PSoC_UART_UART_PARITY_TYPE) ?      \
                                  (PC_PSoC_UART_GET_UART_RX_CTRL_PARITY(PC_PSoC_UART_UART_PARITY_TYPE) | \
                                   PC_PSoC_UART_UART_RX_CTRL_PARITY_ENABLED) : (0u))

    #define PC_PSoC_UART_UART_DEFAULT_UART_RX_CTRL \
                    (PC_PSoC_UART_GET_UART_RX_CTRL_MODE(PC_PSoC_UART_UART_STOP_BITS_NUM)                    | \
                     PC_PSoC_UART_GET_UART_RX_CTRL_POLARITY(PC_PSoC_UART_UART_IRDA_POLARITY)                | \
                     PC_PSoC_UART_GET_UART_RX_CTRL_MP_MODE(PC_PSoC_UART_UART_MP_MODE_ENABLE)                | \
                     PC_PSoC_UART_GET_UART_RX_CTRL_DROP_ON_PARITY_ERR(PC_PSoC_UART_UART_DROP_ON_PARITY_ERR) | \
                     PC_PSoC_UART_GET_UART_RX_CTRL_DROP_ON_FRAME_ERR(PC_PSoC_UART_UART_DROP_ON_FRAME_ERR)   | \
                     PC_PSoC_UART_UART_DEFAULT_RX_CTRL_PARITY)

    #define PC_PSoC_UART_UART_DEFAULT_RX_CTRL \
                                (PC_PSoC_UART_GET_RX_CTRL_DATA_WIDTH(PC_PSoC_UART_UART_DATA_BITS_NUM)        | \
                                 PC_PSoC_UART_GET_RX_CTRL_MEDIAN    (PC_PSoC_UART_UART_MEDIAN_FILTER_ENABLE) | \
                                 PC_PSoC_UART_GET_UART_RX_CTRL_ENABLED(PC_PSoC_UART_UART_DIRECTION))

    #define PC_PSoC_UART_UART_DEFAULT_RX_FIFO_CTRL \
                                PC_PSoC_UART_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(PC_PSoC_UART_UART_RX_TRIGGER_LEVEL)

    #define PC_PSoC_UART_UART_DEFAULT_RX_MATCH_REG  ((0u != PC_PSoC_UART_UART_MP_MODE_ENABLE) ?          \
                                (PC_PSoC_UART_GET_RX_MATCH_ADDR(PC_PSoC_UART_UART_MP_RX_ADDRESS) | \
                                 PC_PSoC_UART_GET_RX_MATCH_MASK(PC_PSoC_UART_UART_MP_RX_ADDRESS_MASK)) : (0u))

    /* TX direction */
    #define PC_PSoC_UART_UART_DEFAULT_TX_CTRL_PARITY (PC_PSoC_UART_UART_DEFAULT_RX_CTRL_PARITY)

    #define PC_PSoC_UART_UART_DEFAULT_UART_TX_CTRL \
                                (PC_PSoC_UART_GET_UART_TX_CTRL_MODE(PC_PSoC_UART_UART_STOP_BITS_NUM)       | \
                                 PC_PSoC_UART_GET_UART_TX_CTRL_RETRY_NACK(PC_PSoC_UART_UART_RETRY_ON_NACK) | \
                                 PC_PSoC_UART_UART_DEFAULT_TX_CTRL_PARITY)

    #define PC_PSoC_UART_UART_DEFAULT_TX_CTRL \
                                (PC_PSoC_UART_GET_TX_CTRL_DATA_WIDTH(PC_PSoC_UART_UART_DATA_BITS_NUM) | \
                                 PC_PSoC_UART_GET_UART_TX_CTRL_ENABLED(PC_PSoC_UART_UART_DIRECTION))

    #define PC_PSoC_UART_UART_DEFAULT_TX_FIFO_CTRL \
                                PC_PSoC_UART_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(PC_PSoC_UART_UART_TX_TRIGGER_LEVEL)

    #define PC_PSoC_UART_UART_DEFAULT_FLOW_CTRL \
                        (PC_PSoC_UART_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(PC_PSoC_UART_UART_RTS_FIFO_LEVEL) | \
                         PC_PSoC_UART_GET_UART_FLOW_CTRL_RTS_POLARITY (PC_PSoC_UART_UART_RTS_POLARITY)   | \
                         PC_PSoC_UART_GET_UART_FLOW_CTRL_CTS_POLARITY (PC_PSoC_UART_UART_CTS_POLARITY)   | \
                         PC_PSoC_UART_GET_UART_FLOW_CTRL_CTS_ENABLE   (PC_PSoC_UART_UART_CTS_ENABLE))

    /* Interrupt sources */
    #define PC_PSoC_UART_UART_DEFAULT_INTR_I2C_EC_MASK  (PC_PSoC_UART_NO_INTR_SOURCES)
    #define PC_PSoC_UART_UART_DEFAULT_INTR_SPI_EC_MASK  (PC_PSoC_UART_NO_INTR_SOURCES)
    #define PC_PSoC_UART_UART_DEFAULT_INTR_SLAVE_MASK   (PC_PSoC_UART_NO_INTR_SOURCES)
    #define PC_PSoC_UART_UART_DEFAULT_INTR_MASTER_MASK  (PC_PSoC_UART_NO_INTR_SOURCES)
    #define PC_PSoC_UART_UART_DEFAULT_INTR_RX_MASK      (PC_PSoC_UART_UART_INTR_RX_MASK)
    #define PC_PSoC_UART_UART_DEFAULT_INTR_TX_MASK      (PC_PSoC_UART_UART_INTR_TX_MASK)

#endif /* (PC_PSoC_UART_SCB_MODE_UART_CONST_CFG) */


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

#define PC_PSoC_UART_SPIM_ACTIVE_SS0    (PC_PSoC_UART_SPI_SLAVE_SELECT0)
#define PC_PSoC_UART_SPIM_ACTIVE_SS1    (PC_PSoC_UART_SPI_SLAVE_SELECT1)
#define PC_PSoC_UART_SPIM_ACTIVE_SS2    (PC_PSoC_UART_SPI_SLAVE_SELECT2)
#define PC_PSoC_UART_SPIM_ACTIVE_SS3    (PC_PSoC_UART_SPI_SLAVE_SELECT3)

#endif /* CY_SCB_SPI_UART_PC_PSoC_UART_H */


/* [] END OF FILE */
